In [11]:
import numpy as np
import pandas as pd
import datetime

In [12]:
"""pandas硬背。
dataframe.to_csv存储时默认的encoding是utf8，如果有汉字且在excel打开时请指定GB2312。
dataframe存储时默认加一列index，一般需指定index=False。
dataframe存储时默认header=True，当header=False第一行变为header。注意header=n有歧义，当n=0时等价于header=False，当n!=0时等价于header=True，注意这个n不是指的第几行。
pd.read_csv读取数据默认encoding是utf8。
pd.read_csv读取数据时默认在原始数据前加一列索引，0开始递增。
pd.read_csv读取数据时默认header=0，也就是原始数据第一行（通常是列名）。如果指写header=3则以第4行作为列名，且跳过前三行数据不读取（包括列名）。注意header不能赋值True或False。
"""
1

1

# dataframe

### dataframe创建

In [14]:
pd.DataFrame(np.arange(6).reshape(2, 3), columns=list('abc'), index=range(11,13), dtype='int')  # the dtype parameter assignment all columns

    a  b  c
11  0  1  2
12  3  4  5

In [15]:
sr1 = pd.Series(list('xyz'),index=range(3))
pd.DataFrame([[1,2,3],(11,12,13),sr1],columns=list('abc'),index=range(11,14), dtype='int')  # 元组同理

     a   b   c
11   1   2   3
12  11  12  13
13   x   y   z

In [16]:
sr1 = pd.Series(list('abc'),index=range(3))
sr2 = pd.Series(list('bcd'),index=range(1,4))
pd.DataFrame({'xa':sr1,'xb':sr2,'xc':[11,22,33,44],'xd':(6,7,8,9)})  # 通过字典创建时，若指定columns，冲突时以columns为准，仅columns有的设置为空列，仅字典有的不加入dataframe

    xa   xb  xc  xd
0    a  NaN  11   6
1    b    b  22   7
2    c    c  33   8
3  NaN    d  44   9

### dataframe columns操作

In [19]:
df1 = pd.DataFrame(np.arange(6).reshape(2, 3), columns=list('abc'), index=range(11,13), dtype='int'); df1  # the dtype parameter assignment all columns

    a  b  c
11  0  1  2
12  3  4  5

In [20]:
df1.columns.name  # defult None

In [21]:
df1.columns.name = 'wanghl'  # assignment
df1.columns.name

'wanghl'

In [22]:
df1.columns  # return index

Index(['a', 'b', 'c'], dtype='object', name='wanghl')

In [26]:
df1.columns = list('xyz'); df1  # modify in place

    x  y  z
11  0  1  2
12  3  4  5

In [24]:
list(df1)  # return list

['x', 'y', 'z']

In [27]:
df2 = df1.add_prefix('w_'); df2  # create new

    w_x  w_y  w_z
11    0    1    2
12    3    4    5

### dataframe index操作

In [28]:
df1 = pd.DataFrame(np.arange(6).reshape(2, 3), columns=list('abc'), index=range(11,13), dtype='int'); df1  # the dtype parameter assignment all columns

    a  b  c
11  0  1  2
12  3  4  5

In [29]:
df1.index.name  # default None

In [30]:
df1.index.name = 'wanghl'
df1.index.name

'wanghl'

In [31]:
df1.index  # return index

RangeIndex(start=11, stop=13, step=1, name='wanghl')

In [33]:
df1.index = list('ab'); df1  # modify in place

   a  b  c
a  0  1  2
b  3  4  5

### copy操作

In [35]:
df1 = pd.DataFrame(np.arange(6).reshape(2, 3), columns=list('abc'), index=range(11,13), dtype='int')  # the dtype parameter assignment all columns

In [36]:
df2 = df1; df2['a'] = 66; df1  # df1 and df2 point to the same location

     a  b  c
11  66  1  2
12  66  4  5

In [37]:
df2 = df1.copy()  # df2 and df1 point to different location

### slice操作

In [38]:
df1 = pd.DataFrame([[4,5,6],[44,55,66]],columns=[1, 2, 'c'], index=range(1,3), dtype='int'); df1  # the dtype parameter assignment all columns

    1   2   c
1   4   5   6
2  44  55  66

In [46]:
"""df1.loc[:, 'c']"""
df1.c  # by columns, label based(only string), return series
"""df1.loc[:, 1]"""
df1[1]  # by columns, label based, return series
"""df1.loc[:, [1]]"""
df1[[1]]  # by columns, label based, return dataframe
"""df1.iloc[:1]"""
df1[:1]  # by rows, positional based, return dataframe
"""df1.iloc[[1]]"""
df1.take([1])  # by rows, positional based(can't use ":"), return dataframe
"""df1.loc[1]"""
df1.xs(1)  # by row(one row each time), label based, return series

1    4
2    5
c    6
Name: 1, dtype: int32

### 赋值操作

In [47]:
df1 = pd.DataFrame([[4,5,6],[44,55,66]],columns=[1, 2, 'c'], index=range(1,3), dtype='int'); df1  # the dtype parameter assignment all columns

    1   2   c
1   4   5   6
2  44  55  66

In [73]:
"""以下赋值均为in place"""
df1.c = 'x'
df1[1] = 'x'
df1[[1]] = 'x'
df1[:1] = 'x'
df1.loc[1] = 'x'
df1.loc[[1]] = 'x'
df1.iloc[1] = 'x'
df1.iloc[[1]] = 'x'
"""注意at只改变1个值，这个新值的数据类型不能与原来列的数据类型冲突"""
df1.at[1,1] = 111
df1.iat[1,1] = 222
"""不可以赋值，因为是function call"""
df1.take([1])  # 对新得到的dataframe赋值，不会改变原来的df1
df1.xs(1)  # 对新得到的series赋值，会改变原来的df1

1    111
2      x
c      x
Name: 1, dtype: object

In [899]:
df1 = pd.DataFrame([[4,5,6],[44,55,66]],columns=[1, 2, 'c'], index=range(1,3), dtype='float'); df1  # the dtype parameter assignment all columns

      1     2     c
1   4.0   5.0   6.0
2  44.0  55.0  66.0

In [876]:
"""关于ndarry,list,series,dict,dataframe"""
df1.c = ['x','y']; df1

      1     2  c
1   4.0   5.0  x
2  44.0  55.0  y

In [887]:
df1

      1     2     c
1   4.0   5.0   6.0
2  44.0  55.0  66.0

In [890]:
dd

{1: 'xx', 2: 'yy', 3: 'zz'}

In [891]:
ddd = pd.Series(dd)

In [892]:
ddd

1    xx
2    yy
3    zz
dtype: object

In [898]:
df1.c = dd

In [894]:
df1

      1     2   c
1   4.0   5.0  xx
2  44.0  55.0  yy

In [897]:
dd = {1:'xx',2:'yy'}

### 删除操作

In [77]:
df1 = pd.DataFrame([[4,5,6],[44,55,66]],columns=[1, 2, 'c'], index=range(1,3), dtype='int')  # the dtype parameter assignment all columns

In [78]:
df1.drop([1,'c'], axis=1)  # delete by label, create new, can multi column each time

    2
1   5
2  55

In [79]:
df1.drop([1], axis=0)  # delete by label, create new, can multi column each time

    1   2   c
2  44  55  66

In [80]:
del df1[1]; df1  # delete by label, in place, one column each time

    2   c
1   5   6
2  55  66

### filter操作

In [81]:
df1 = pd.DataFrame([[4,5,6],[44,55,66]],columns=[1, 2, 'c'], index=range(1,3), dtype='int')  # the dtype parameter assignment all columns

In [90]:
"""
df1[df1['column'].isin([1,2,3,4])]
df1[df1['column'] >= 66]
"""
df1[[True, False]][[False]]  #  by rows, bool based, return dataframe

Empty DataFrame
Columns: [1, 2, c]
Index: []

In [91]:
df1[df1>10]  # filter by cell

      1     2     c
1   NaN   NaN   NaN
2  44.0  55.0  66.0

### value操作

In [85]:
df1 = pd.DataFrame([[4,5,6],[44,55,66]],columns=[1, 2, 'c'], index=range(1,3), dtype='int')  # the dtype parameter assignment all columns
df1.values  # return numpy

array([[ 4,  5,  6],
       [44, 55, 66]])

In [86]:
df1.values.tolist()  # tolist is a method of numpy

[[4, 5, 6], [44, 55, 66]]

In [87]:
"""transposition"""
df1.T.values.tolist() == df1.values.T.tolist()

True

### dtype操作

In [89]:
df1 = pd.DataFrame([[4,5,6],[44,55,66]],columns=[1, 2, 'c'], index=range(1,3), dtype='float'); df1  # the dtype parameter assignment all columns

      1     2     c
1   4.0   5.0   6.0
2  44.0  55.0  66.0

In [745]:
df1.dtypes  # return series

1    float64
2    float64
c    float64
dtype: object

In [746]:
sr1 = df1[1].astype(int); sr1  # create new series, don't modify original dataframe

1     4
2    44
Name: 1, dtype: int32

In [747]:
df2 = df1.astype(int); df1  # create new dataframe, don't modify original dataframe

      1     2     c
1   4.0   5.0   6.0
2  44.0  55.0  66.0

In [748]:
df1

      1     2     c
1   4.0   5.0   6.0
2  44.0  55.0  66.0

### loc和iloc操作

In [92]:
dfloc = pd.DataFrame([[1,2,3],[11,22,33],[111,222,333]], columns=list('zxy'), index=list('cab')); dfloc  # the dtype parameter assignment all columns

     z    x    y
c    1    2    3
a   11   22   33
b  111  222  333

In [93]:
dfloc.loc['a']

z    11
x    22
y    33
Name: a, dtype: int64

In [94]:
dfloc.loc[['a']]

    z   x   y
a  11  22  33

In [699]:
dfloc.loc[:'a']

    z   x   y
c   1   2   3
a  11  22  33

In [700]:
dfloc.loc[:,'x']

c      2
a     22
b    222
Name: x, dtype: int64

In [701]:
dfloc.loc[:,['x']]

     x
c    2
a   22
b  222

In [703]:
dfloc.loc[:,:'x']

     z    x
c    1    2
a   11   22
b  111  222

In [704]:
dfloc.loc['a','x']

22

In [705]:
dfloc.loc[['a','a'],['x','x']]

    x   x
a  22  22
a  22  22

In [706]:
dfloc.loc[:'a',:'x']

    z   x
c   1   2
a  11  22

In [707]:
dfloc.loc['a',['x','x']]

x    22
x    22
Name: a, dtype: int64

In [708]:
dfloc.loc['a',:'x']

z    11
x    22
Name: a, dtype: int64

In [709]:
dfloc.loc[:'a',['x','x']]

    x   x
c   2   2
a  22  22

In [711]:
"""关于使用loc索引数值时的两个坑"""
"""即使str(9)作为索引，dataframe也会按照number来处理，与9无区别"""
dfloc_ = pd.DataFrame([[1,2,3],[11,22,33],[111,222,333]], columns=[6, 'a', str(9)], index=[11, 11, 22]); dfloc_  # mixed index of number and string

      6    a    9
11    1    2    3
11   11   22   33
22  111  222  333

In [712]:
"""坑1：当行列索引为纯number组成时，并且按位置排序时索引的number不减少（递增或不减）时，则帽号前后的数字可不在现有索引中，dataframe会按数值来比较大小进行切片。
如果纯number组成的索引出现递减的情况，帽号前后使用索引之外的数字会报错KeyError"""
dfloc_.loc[1:12]

     6   a   9
11   1   2   3
11  11  22  33

In [713]:
"""坑2：当两种条件同时满足会报错：数字和字母混合索引，帽号前后是数字。比如df2.loc[:,:9], 会报错TypeError"""
dfloc_.loc[:11,:'a']

     6   a
11   1   2
11  11  22

In [737]:
dfiloc = pd.DataFrame([[4,5,6],[44,55,66]], columns=list('xyz'), index=list('ab')); dfiloc

    x   y   z
a   4   5   6
b  44  55  66

In [716]:
dfiloc.iloc[1]

x    44
y    55
z    66
Name: b, dtype: int64

In [717]:
dfiloc.iloc[[1]]

    x   y   z
b  44  55  66

In [719]:
dfiloc.iloc[:1]

   x  y  z
a  4  5  6

In [720]:
dfiloc.iloc[:,1]

a     5
b    55
Name: y, dtype: int64

In [721]:
dfiloc.iloc[:,[1]]

    y
a   5
b  55

In [723]:
dfiloc.iloc[:,:1]

    x
a   4
b  44

In [724]:
dfiloc.iloc[1,1]

55

In [725]:
dfiloc.iloc[[1,1],[1,1]]

    y   y
b  55  55
b  55  55

In [726]:
dfiloc.iloc[:1,:1]

   x
a  4

In [727]:
dfiloc.iloc[1, [1, 1]]

y    55
y    55
Name: b, dtype: int64

In [728]:
dfiloc.iloc[1, :1]

x    44
Name: b, dtype: int64

In [729]:
dfiloc.iloc[:1, [1,1]]

   y  y
a  5  5

### at和iat操作

In [739]:
df1 = pd.DataFrame([[4,5,6],[44,55,66]], columns=[1, 2, 'c'], index=range(1,3), dtype='float'); df1  # the dtype parameter assignment all columns

      1     2     c
1   4.0   5.0   6.0
2  44.0  55.0  66.0

In [740]:
df1.at[1,1]  #  by cell, label based, return value

4.0

In [741]:
df1.iat[1,1]  #  by cell, positional based, return value

55.0

In [742]:
df1.at[1,1] = 111; df1  # modify in place, label based

       1     2     c
1  111.0   5.0   6.0
2   44.0  55.0  66.0

In [743]:
df1.iat[1,1] = 222; df1  # modify in place, positional based

       1      2     c
1  111.0    5.0   6.0
2   44.0  222.0  66.0

### dataframe iter操作

In [45]:
df1 = pd.DataFrame(np.random.randn(2,3), columns=list('abc'), dtype='float')  # 好像所有列只能指定一种类型
df1

          a         b         c
0  1.823473 -1.405473  1.479241
1  0.728144  0.889411  1.002924

In [46]:
list(df1.iterrows())  # return iterator by rows, (index, Series)

[(0, a    1.823473
  b   -1.405473
  c    1.479241
  Name: 0, dtype: float64), (1, a    0.728144
  b    0.889411
  c    1.002924
  Name: 1, dtype: float64)]

In [47]:
list(df1.itertuples())  # return iterator by rows, tuple

[Pandas(Index=0, a=1.8234731035555074, b=-1.4054728898646573, c=1.4792407047394502),
 Pandas(Index=1, a=0.7281438492974119, b=0.8894107563906615, c=1.0029242576572879)]

In [48]:
list(df1.iteritems())  # return iterator by columns, (column, Series)

[('a', 0    1.823473
  1    0.728144
  Name: a, dtype: float64), ('b', 0   -1.405473
  1    0.889411
  Name: b, dtype: float64), ('c', 0    1.479241
  1    1.002924
  Name: c, dtype: float64)]

___

In [ ]:
df1.loc['aa'] = [55,66]  # 新增或替换一行的值
df1

In [12]:
df1['cc'] = 'newc'  # 新增或替换一列的值
df1

            a          b    cc
0    0.929709   0.554013  newc
1    0.828853   0.337821  newc
2    0.465323   0.417198  newc
aa  55.000000  66.000000  newc

In [13]:
df1['a'].unique()  # 某列的唯一值

array([ 0.92970854,  0.8288529 ,  0.46532272, 55.        ])

# series

### series创建

In [51]:
pd.Series({11:111,22:222,})

11    111
22    222
dtype: int64

In [52]:
pd.Series({11:111,33:333,},index=[11,22,33])

11    111.0
22      NaN
33    333.0
dtype: float64

In [14]:
sr1 = pd.Series(list('abcde'),index=[2,4,6,3,5])
sr1

2    a
4    b
6    c
3    d
5    e
dtype: object

In [ ]:
"""创建时，默认index.name为空"""
sr1.index.name

In [17]:
sr1.index.name = 'hi'

In [19]:
"""创建时，默认name为空"""
sr1.name

In [60]:
sr1.name = 'ww'

### series切片

In [70]:
sr1 = pd.Series(list('abcd'),index=range(2,6))
sr1

2    a
3    b
4    c
5    d
dtype: object

In [71]:
sr2 = pd.Series(range(4),index=list('xymn'))
sr2

x    0
y    1
m    2
n    3
dtype: int64

In [72]:
"""切片返回单个元素"""
"""当series索引本身是int或float，下面这种单个元素切片是按值索引，而不是位置"""
print(sr1[3])
print(sr2['m'])

b
2

In [74]:
"""切片返回series"""
print(sr1[[3,1]])
print(sr1[[3]])
print(sr2[['a','m']])
print(sr2[['m']])
print(sr1[1:2])
print(sr1[1:1])
"""对于字符串索引的帽号切片，是按字母位置而不是按字母顺序，注意这里包含切片的最后一个元素"""
print(sr2['y':'n'])

3      b
1    NaN
dtype: object
3    b
dtype: object
a    NaN
m    2.0
dtype: float64
m    2
dtype: int64
3    b
dtype: object
Series([], dtype: object)
y    1
m    2
n    3
dtype: int64

In [101]:
"""bool切片必返回series，这点类似帽号切片"""
sr3 = pd.Series(list('abcd'),index=range(4))
sr4 = pd.Series(list('abcd'),index=range(2,6))
bseries = sr3=='b'
blist = list(bool1)
print(sr3)
print(sr4)
print(bool1)
print(bool2)
"""使用series进行bool切片，要求series的index必须完全匹配。
sr4[bseries]会报错，因为sr4和bseries的index不完全匹配"""
print(sr3[bseries])
print(sr3[blist])
print(sr4[blist])

0    a
1    b
2    c
3    d
dtype: object
2    a
3    b
4    c
5    d
dtype: object
0    False
1     True
2    False
3    False
dtype: bool
[False, True, False, False]
1    b
dtype: object
1    b
dtype: object
3    b
dtype: object

### series一些操作

In [31]:
sr1 = pd.Series(range(4), index=list('abcd'))
sr1.values

array([0, 1, 2, 3], dtype=int64)

In [32]:
sr1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [33]:
sr1.index = range(4)
sr1.index

RangeIndex(start=0, stop=4, step=1)

### series复制

In [92]:
sr1 = pd.Series(list('abcde'),index=[2,4,6,3,5])
sr1

2    a
4    b
6    c
3    d
5    e
dtype: object

In [93]:
"""直接复制，sr1_a和sr1指向同一个物理地址，修改会相互影响"""
sr1_a = sr1
sr1_a.index = [21,22,23,24,25]
sr1

21    a
22    b
23    c
24    d
25    e
dtype: object

In [94]:
"""使用copy复制，修改sr1_b不会影响sr1"""
sr1_b = sr1.copy()
sr1_b.index = [111,222,333,444,555]
sr1

21    a
22    b
23    c
24    d
25    e
dtype: object

In [161]:
"""切片后得到的series与原来的指向同一个value，但index是各自的"""
sr1 = pd.Series(list('abcde'),index=range(5))
ssr1 = sr1[1:4]
print(ssr1)
"""下面这种修改ssr1不会修改sr1的index"""
ssr1.index = [11,22,33]
print(ssr1)
print(sr1)
"""给ssr1原来的索引赋值，会影响sr1的value。因为二者的index是各自的，但指向同一个内存位置的value"""
ssr1[[11,22]] = ['bb','cc']
print(ssr1)
print(sr1)
"""当给ssr1新增一个索引时，ssr1不再与sr1指向同一个内存位置的value。此时修改ssr1的index或value，都不会改变sr1"""
ssr1[44] = 'xx'
print(ssr1)
print(sr1)
"""修改ssr1的value，不再改变sr1的value，二者的value也是各自的"""
ssr1[33] = 'dd'
print(ssr1)
print(sr1)
"""显然，这样修改ssr1=['x','xx','xxx']是对ssr1重新赋值，也会导致sr1与ssr1不再共享value，各自修改不受影响"""
print('byby')

1    b
2    c
3    d
dtype: object
11    b
22    c
33    d
dtype: object
0    a
1    b
2    c
3    d
4    e
dtype: object
11    bb
22    cc
33     d
dtype: object
0     a
1    bb
2    cc
3     d
4     e
dtype: object
11    bb
22    cc
33     d
44    xx
dtype: object
0     a
1    bb
2    cc
3     d
4     e
dtype: object
11    bb
22    cc
33    dd
44    xx
dtype: object
0     a
1    bb
2    cc
3     d
4     e
dtype: object
byby

### series增删改

In [73]:
sr1.drop(21)

22    b
23    c
24    d
25    e
Name: ww, dtype: object

In [75]:
sr1.drop([21,23,25])

22    b
24    d
Name: ww, dtype: object

### series运算

In [7]:
sr1 = pd.Series(range(3),index=range(3))
sr2 = pd.Series(range(3),index=range(1,4))
print(sr1,'\n',sr2)

0    0
1    1
2    2
dtype: int64
 1    0
2    1
3    2
dtype: int64

In [9]:
"""series相加是按index对齐的"""
sr1+sr2

0    NaN
1    1.0
2    3.0
3    NaN
dtype: float64

In [10]:
sr1*2

0    0
1    2
2    4
dtype: int64

In [11]:
import numpy as np
np.exp(sr1)

0    1.000000
1    2.718282
2    7.389056
dtype: float64

In [13]:
"""查看某索引是否在obj中，返回bool"""
print(2 in sr1)
print(2 & 8 | 2 in sr1)

True
True

In [14]:
"""缺失值判断"""
sr3 = pd.Series(['a',None,'',0],index=[1,2,3,4])
sr3

1       a
2    None
3
4       0
dtype: object

In [15]:
pd.isnull(sr3)

1    False
2     True
3    False
4    False
dtype: bool

In [16]:
pd.notnull(sr3)

1     True
2    False
3     True
4     True
dtype: bool

In [17]:
sr3.isnull()

1    False
2     True
3    False
4    False
dtype: bool

___

In [ ]:
"""未整理"""
df['label'] = df['label'].map({'a': 0, 'b': 1, 'd': 2})

In [10]:
"""时间解析函数"""
pd.to_datetime(['1/22/2018', np.datetime64('2018-01-22'),datetime.datetime(2018, 1, 22)])

DatetimeIndex(['2018-01-22', '2018-01-22', '2018-01-22'], dtype='datetime64[ns]', freq=None)